package com.wahaha.myapplication.Activies;

import android.database.SQLException;
import android.database.sqlite.SQLiteDatabase;
import android.util.Log;

/**
 * Created by user1 on 7/5/2019.
 */
public class Database {
    SQLiteDatabase db;
    public void insertTable() {

    }

    public void openDb()
    {
        db = SQLiteDatabase.openDatabase("data/data/com.wahaha.myapplication/disHistory",
                null, SQLiteDatabase.CREATE_IF_NECESSARY);
    }

    public void createTable() {
        try {

            db.beginTransaction();
            db.execSQL("create table disHistory("
                    + "hID integer PRIMARY KEY AUTOINCREMENT,"
                    + "title text,"
                    + "year text,"
                    + "description text);");

            Log.i("Create ","Table ");

            db.setTransactionSuccessful();
           // Toast.makeText(this, "Table was created", Toast.LENGTH_LONG).show();

        } catch (SQLException e) {
           // Toast.makeText(this, e.getMessage(), Toast.LENGTH_LONG).show();
        } finally {
            db.endTransaction();
        }
        db.beginTransaction();
        try
        {
            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ဆိုင်ကလုံးမုန်တိုင်း','2017','မိုရာဆိုင်ကလုန်း (Cyclone Mora) သည် ၂၀၁၇ ခုနှစ် မေလတွင် သီရိလင်္ကာ၊ဘင်္ဂလားဒေ့ရှ်၊ မြန်မာနှင့်အိန္ဒိယအရှေ့မြောက်တွင့်ပျက်စီးမှုများပြား၍ ရေလွှမ်းမိုးမှုပြင်းထန်သော အပူပိုင်းဆိုင်ကလုန်းမုန်တိုင်းတစ်ခုဖြစ်သညိ။ ရခိုင်ပြည်နယ်တွင် လူနေအိမ် လေးထောင်ကျော်၊  ချင်းပြည်နယ်နှင့်ဧရာဝတီတိုင်းတွင် လူနေအိမ် တစ်သောင်းသုံးထောင်ကျော် နှင့် ဘာသာရေးအဆောင်အဦး ငါးဆယိကျော်ဆုံးရှုံးခံ့ရသည်။\n ');");


            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ဆိုင်ကလုံးမုန်တိုင်း','2008','နာဂစ်မုန်တိုင်း သည် မြန်မာနိုင်ငံသမိုင်းတွင် အဆိုးရွားဆုံးသော သဘာဝဘေးအန္တရာယ်တစ်ခုဖြစ်ပြီး ၂၀၀၈ ခုနှစ် မေလတွင် ဖြစ်ပွားခဲ့သည်။မုန်တိုင်းသည် မြန်မာနိုင်ငံကုန်းမြေသို့ ၂၀၀၈ ခုနှစ် မေလ ၂ ရက်နေ့တွင် စတင်ဝင်ရောက်လာခဲ့ပြီး ဧရာဝတီ မြစ်ဝကျွန်းပေါ်ဒေသတွင် ကီလိုမီတာ ၄၀ ခန့်အထိ ဝင်ရောက်ခဲ့ကာ ကြီးမားသော ပျက်စီးမှုများကို ဖြစ်ပေါ်စေခဲ့ပြီး ၁၃၈,၀၀၀ ခန့် သေဆုံးခဲ့ကြရသည်။လပွတ္တာမြို့နယ်တစ်ခုတည်းမှာပင် ၈၀,၀၀၀ ခန့်သေဆုံးခဲ့ပြီး ဘိုကလေးမြို့တွင် ၁၀,၀၀၀ ခန့် သေဆုံးခဲ့သည်။ပျက်စီးဆုံးရှုံးမှုတန်ဖိုးမှာ ကျပ် ၆၂,၉၈၈,၀၀၀,၀၀၀ (အမေရိကန်ဒေါ်လာ ၁၀ ဘီလီယံ) ကျော် ဖြစ်ကာ မြောက်အိန္ဒိယသမုဒ္ဒရာအတွင်း ဖြစ်ပေါ်ခဲ့သော မုန်တိုင်းများအနက် ပျက်စီးဆုံးရှုံးမှုအများဆုံး မုန်တိုင်းတစ်ခုအဖြစ် မှတ်တမ်းဝင်ခဲ့သည် ');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('တိုင်ဖွန်းမုန်တိုင်း','2003','ခုနှဈတှငျဆိုငျကလုနျး');");
            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('တိုင်ဖွန်းမုန်တိုင်း','2005','ခုနှဈတှငျဆိုငျကလုနျး');");


            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ဆူနာမီမုန်တိုင်း','2001','ဖြစ်ပွားခဲ့ခြင်းမရှိပါ။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ရေကြီးခြင်း','2012','၂၀၁၂ခုနှစ် အောက်တိုဘာလတွင် ရေကြီးမှု့ကြောင့် လူ၁၀၀ကျော်သေဆုံးပြီး၊ တစ်ထောင်ကျော်အိုးမဲ့အိမ်မဲ့ဖြစ်ခဲ့ရသည်။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ရေကြီးခြင်း','2018','မုတ်သုံရာသီ မိုးသည်းထန်စွာရွာသွန်းသဖြင့်ရေကြီးခြင်းသည် အများအားဖြင့်ဖြစ်ပွားလေ့ရှိသည်။၂၀၁၈ ခုနှစ်၊ ဇူလိုင်၉ရက်ခန့်က ရေကြီးမှု့ကြောင့် ၁၆ဦးသေဆုံးခဲ့ပြီး ၊ ၁၅၀၀၀၀ကျော် ပြောင်းရွှေနေထိုင်ခဲ့ရသည်။ဤလူအချို့သည်၎င်းတို့၏နေအိမ်များမှပြန်သွားကြသည်။သဘာဝဘေးစီမံခန့်ခွဲမှု၏အစိုးရဌာနသည် ရေဘေးနှင့်ပက်သက်ပြီး ဒေသဆိုင်ရာများနှင့်ပူးပေါင်းကာ ဆောက်ရွက်ခဲ့သည်။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ငလျင်ဘေး','2017','မတ်လ ၁၃ ရက်နေ့ ည ၈ နာရီ ၄၉ မိနစ်က တိုက်ကြီးမြို့၏ အနောက်တောင်ဘက် ၅ မိုင်ခန့် အကွာကို ဗဟိုပြု၍ အင်အား ၅ ဒသမ ၈ ရစ်ခ်ျတာ စကေးရှိ ငလျင် လှုပ်ခတ်ခဲ့ပြီး ည ၁၀ နာရီ ၁၉ မိနစ်တွင်လည်း တိုက်ကြီးမြို့ အရှေ့တောင်ဘက် ၇ မိုင်ခန့် အကွာကို ဗဟိုပြု၍ အင်အား ၄ ဒသမ ၇ အဆင့်ရှိ ငလျင်တစ်ခု ထပ်မံလှုပ်ခတ်ခဲ့ရာ လူနှင့် နေအိမ်ပစ္စည်းများ ထိခိုက်ခဲ့သည်။\n');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('ငလျင်ဘေး','2018','ဇန်နဝါရီ၂ဝရက် မြန်မာစံတော်ချိန် မွန်းလွဲ ၁၂နာရီ ၃၅ မိနစ် ၅၈ စက္ကန့်တွင် ကမ္ဘာအေး မြေငလျင်စခန်းမှ မြောက်-အရှေ့မြောက်ဘက် ၈၈ မိုင်ခန့်ကွာဝေးသော ဖြူးမြို့၏တောင်-အနောက်တောင်ဘက် ၂၄ မိုင်ခန့်အကွာ မြောက်လတ္တီတွဒ် ၁၈ ဒသမ ၁၃ ဒီဂရီ၊ အရှေ့ လောင်ဂျီတွဒ် ၉၆ ဒသမ ၃၈ ဒီဂရီ၊ အနက် ၁၈ ကီလိုမီတာကိုဗဟိုပြု၍ အင်အားရစ်ချ်တာ စကေး ၄ ဒသမ သုည အဆင့်ရှိ အင်အားနည်းမြေငလျင်တစ်ခု လှုပ်ခတ်ခဲ့ကြောင်း ထုတ်ပြန် ခဲ့သည်။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('မိုးခေါင်ရေရှားဘေး','2016','၂၀၁၆ခုနှစ်တွင် အပူချိန်လွန်ကဲ၍ မိုးခေါင်နေမှုကြောင့် မိုးစပါးစိုက်ပျိုးရန် အခက်အခဲများ ဖြစ်ပေါ် ပြီး စပါးခင်းအချို့ ရေရရှိမှုမရှိသဖြင့် သေဆုံး ပျက်စီးကာ မြန်မာနိုင်ငံအလယ်ပိုင်းတွင် ဒဏ်ခံခဲ့ရသည်။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('မြေပြိုဘေး','2018','ထားဝယ်ဒေသရှိ သမိုင်းဝင်ရှင်ကိုးရှင်အနက် ဘုရားတစ်ဆူဖြစ် သည့် ရှင်မော်ဘုရား တောင်ကုန်းတွင် သြဂုတ် ၁ ရက် က မြေပြိုခဲ့သည်။မိုးသည်းထန်စွာရွာသွန်းမှုကြောင့် နံနက် ၅ နာရီခန့်မှစ၍ ဘုရား တောင်ကုန်း၏ အလျားပေ ၇၀ ခန့်မြေပြိုကျ ခဲ့ခြင်းဖြစ်သည်။');");

            db.execSQL("insert into disHistory(title,year,description)"
                    + "values('မြေပြိုဘေး','2016','ကချင်ပြည်နယ် ခေါင်လန် ဖူးနှင့်ဆော့လော်မြို့တွင် တောင် ကျရေဆင်းခြင်းနှင့် မြေပြိုခြင်း ကြောင့် လူသေဆုံးမှုဇူလိုင် ၁၀ ရက်ညနေက ဖြစ်ပွားခဲ့သည်။ ဆော့လော်မြို့နယ် မန်ကျီဒေသ တွင် မိုးသည်းထန်စွာရွာသွန်းပြီး အမျိုးသားနှစ်ဦး တောင်ကျရေနှင့် မျောပါသေဆုံးခဲ့သည်။၂၀၁၆ မိုးရာသီကာလက  ဝေးလံခေါင်ဖျား ခေါင်လန် ဖူးမြို့နယ် ဂျာဝမ်ကျေးရွာတွင် မိုး သည်းထန်စွာရွာသွန်းပြီး မြေပြို ၍ မိသားစုဝင်လေးဦးရှိနေသော နေအိမ်တစ်လုံးပြိုကျခဲ့သည်။\n" +
                    "ထားဝယ်ဒေသရှိ သမိုင်းဝင်ရှင်ကိုးရှင်အနက် ဘုရားတစ်ဆူဖြစ် သည့် ရှင်မော်ဘုရား တောင်ကုန်းတွင် သြဂုတ် ၁ ရက် က မြေပြိုခဲ့သည်။မိုးသည်းထန်စွာရွာသွန်းမှုကြောင့် နံနက် ၅ နာရီခန့်မှစ၍ ဘုရား တောင်ကုန်း၏ အလျားပေ ၇၀ ခန့်မြေပြိုကျ ခဲ့ခြင်းဖြစ်သည်။');");


            Log.i("Insert ","Table");
            db.setTransactionSuccessful();


        } catch (SQLException e1)
        {
            //Toast.makeText(getBaseContext(), e1.getMessage(), Toast.LENGTH_LONG).show();
        } finally
        {
            db.endTransaction();
        }
    }
    public void deleteTable() {
        db.beginTransaction();
        db.execSQL("DROP TABLE disHistory");
        db.setTransactionSuccessful();
        db.endTransaction();

    }
}
