package com.wahaha.myapplication.Activies;

import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import androidx.annotation.Nullable;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import com.wahaha.myapplication.R;

public class LandslideHistoryActivity extends AppCompatActivity {

    Toolbar mActionBarToolbar;

    ListView listView;
    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.land_history);
        listView = (ListView) findViewById(R.id.land_why);

        String[] values = new String[]{"\nငလျင်ကြောင့် မြေပြိုခြင်း\n\nအင်အားပြင်းထန်သော မြေငလျင်လှုပ်ခတ်သည့်အခါ ဘူမိသွင်ပြင် ရုတ်ခြည်းပြောင်းလဲသွားမှုကြောင့် မြေပြိုခြင်း ဖြစ်ပွားနိုင်သည်။ ငလျင်ပြင်းအားအပေါ် မူတည်ပြီး မြေပြိုမှုအတိုင်းအတာမှာ အက်ကွဲနိမ့်ကျခြင်းမှသည် လမ်းပန်းဆက်သွယ်ရေး ပြတ်တောက်သွားခြင်းအထိပင် ဖြစ်နိုင်ခြေရှိသည်။ \n","မီးတောင်ပေါက်ကွဲမှုကြောင့် မြေပြိုခြင်း\n\nကမ္ဘာအရပ်ရပ်ရှိ မီးတောင်များ ပေါက်ကွဲပွင့်အန်သည့်အခါ အလွန်ပြင်းထန်သော တုန်ခါမှုကြီး ကြောင့် မြေမျက်နှာသွင်ပြင်၏ မူလအနေအထား ပျက်ယွင်းကာ မြေပြိုကျမှုများဖြစ်ပွားနိုင်သည်။ ပင်လယ်ကမ်းရိုးတန်းရှိ ရေအောက်မီးတောင်များ ပေါက်ကွဲသည့် အခါမျိုး၌လည်း ရေအောက်မြေပြိုမှုနှင့် ပင်လယ်ကမ်းရိုးတန်းတစ်လျှောက် မြေပြိုမှုများ ဖြစ်ပွားလာနိုင်သည်။ ပင်လယ်ပြင်အတွင်းရှိ ကျွန်းပေါ်၌ မီးတောင်ပေါက်ကွဲမှုကြောင့် မြေပြိုမှုအကြီးအကျယ်ဖြစ်ပေါ်ကာ ကျွန်းတစ်ကျွန်းလုံး ပင်လယ်ရေအောက်ရောက်ရှိသွားပြီး စုံးစုံးမြုပ် သွားခဲ့သည့် ဖြစ်ရပ်မျိုးပင်ရှိခဲ့ဖူးသည်။ \n","ပင်လယ်ကမ်းရိုးတန်း မြေပြိုခြင်း\n\nပင်လယ်ဒီရေလှိုင်းလုံးကြီးများ၏ ရိုက်ပုတ်မှုဒဏ်ကို အမြဲတမ်းခံနေရသော ကမ်းရိုးတန်း ဒေသရှိ ကုန်းမြင့်တောင်စောင်းများ၏ အောက်ခံမြေသားများ လှိုက်စားခံရမှု ကာလနှစ်ပရိစ္ဆေဒကြာညောင်းလာသည့်အခါ ကမ်းရိုးတန်းမြေပြိုမှု ဖြစ်ပွားနိုင်သည်။ အင်အားပြင်းထန်သော ဆူနာမီလှိုင်းတံပိုးကြီးများ၏ တွန်းတိုက်ဖျက်ဆီးမှုဒဏ်ကို ကြိမ်ဖန်များစွာခံရလျှင် ကမ်းရိုးတန်းမြေပြိုမှုဖြစ်ပွားနိုင်ခြေ ပို၍ရှိနေသည်။ ဒီရေလှိုင်းများသည် အလွန်ကျယ်ဝန်းပြန့်ပြူးသော သဲသောင်ခုံများ၌ပင် လိုဏ်ခေါင်းကြီးများကို ဖြစ်ပေါ်စေနိုင်ပြီး သဲသောင်ပြင် နိမ့်ဆင်းပြိုကျမှုကို ဖြစ်စေနိုင်သည်။ သို့ဖြစ်၍ ပင်လယ် ကမ်းရိုးတန်းနှင့် ကီလိုမီတာ ၃ဝ အကွာအဝေး အတွင်း၌ ရှိနေသော မြို့ရွာများသည် တစ်ချိန်ချိန်၌ မြေပြိုမှုနှင့် ကြုံတွေ့ကြရနိုင်သည်။ \n","မြစ်ကမ်းဘေး၊ ချောင်းကမ်းပါးများ မြေပြိုခြင်း\n\nရာသီမရွေး အလျဉ်မပြတ်စီးဆင်းနေသည့် မြစ် ချောင်းများ၏ ကမ်းပါးများ၌လည်း မြေပြိုမှုဖြစ်ပွားနိုင်သည်။ မြစ်ရေချောင်းရေ ပုံမှန်တိုက်စားခြင်း၊ မိုးရွာသွန်းမှု အလွန်များပြားသည့်အခါမျိုးနှင့် ဆည်၊ တမံများ ကျိုးပေါက်ပြိုပျက်သည့်အခါမျိုးများ၌ ပုံမှန် မဟုတ်သော ရေထုကြီးကြောင့် မြစ်ကြောင်းလမ်းကြောင်း သွေဖည်ပြောင်းလဲစီးဆင်းခြင်း၊ ရေယာဉ်များ ခုတ် မောင်းသွားလာမှုများပြားလွန်းခြင်း၊ ကမ်းပါးနံရံများကို စနစ်တကျထိန်းသိမ်းစောင့်ရှောက်မှုမရှိခြင်း၊ မြစ်ကမ်းပါး၌ အဆောက်အအုံများကို စည်းကမ်းမဲ့စွာ ဆောက်လုပ်နေထိုင်ခြင်း စသည်တို့သည် မြစ်ချောင်းကမ်းပါး မြေပြိုမှုကို ဖြစ်ပေါ်လာစေနိုင်သော အကြောင်းရင်းများ ဖြစ်ကြသည်။ \n","တောင်စောင်း၊ ချောက်ကမ်းပါးများ မြေပြိုခြင်း\n\nမိုးသည်းထန်စွာ ရွာသွန်းမှုကြောင့် တောင်ကျ ရေများ အရှိန်အဟုန်ဖြင့် စီးဆင်းခြင်း၊ သစ်ပင် သစ်တောများ ခုတ်ထွင်ရှင်းလင်းခြင်း၊ ကားလမ်းနှင့် ရထားလမ်းများ ဖောက်လုပ်သည့်အခါ မြေသားနံရံများကို ဖြိုဖျက်ခြင်း၊ မြေထိန်းနံရံများကို စနစ်တကျ ပြုလုပ်ထားမှုမရှိခြင်း၊ ကမ်းပါးယံအစွန်းများ၌ အဆောက်အအုံ ဆောက်လုပ် နေထိုင်ခြင်း စသည်တို့ကြောင့် တောင်စောင်း၊ ချောက်ကမ်းပါးများ၌ မြေပြိုမှု ဖြစ်ပွားနိုင်သည်။ တောင်စောင်း၊ ချောက်ကမ်းပါးများ၌ မြေပြိုမှု ဖြစ်ပွား သည့်အခါ ကယ်ဆယ်ကူညီရေးလုပ်ငန်းများကို လျင်မြန် ထိရောက်စွာဆောင်ရွက်ရန် အခက်အခဲရှိတတ်သည့်အတွက် အသက်ဆုံးရှုံးနိုင်ခြေပို၍ ရှိနေသည်။ \n","သတ္တုတွင်းများ မြေပြိုခြင်း\n\nသတ္တုမိုင်းများ၌ မြေပြိုခြင်းကို ဖွံ့ဖြိုးဆဲနိုင်ငံများနှင့် ဖွံ့ဖြိုးမှုနောက်ကျသော နိုင်ငံများ၌ အများဆုံး တွေ့ကြုံရလေ့ရှိသည်။ စီမံခန့်ခွဲမှု ညံ့ဖျင်းခြင်း၊ ခေတ်မီ စက်ကိရိယာများ အသုံးပြုနိုင်မှု အားနည်းခြင်း၊ စံမမီသော ပစ္စည်းများကို အသုံးပြုခြင်း၊ ဖြစ်နိုင်ခြေအပေါ် လျှော့ပေါ့တွက်ဆခြင်း၊ မိုင်းလုပ်သားများ အသိပညာ ဗဟုသုတနည်းပါးခြင်း၊ ကုန်ကျစရိတ်သက်သာရေးကိုသာ ဦးစားပေးဆောင်ရွက်ခြင်း စသောအချက်များသည် ကမ္ဘာအရပ်ရပ်ရှိ သတ္တုတွင်းအချို့ကို မြေပြိုကျမှု ဖြစ်စေသော အကြောင်းတရားများ ဖြစ်ကြသည်။ \n","ဥမင်လိုဏ်ခေါင်း မြေပြိုခြင်း\n\nရထားလမ်းနှင့် မော်တော်ကားလမ်းများ ဖောက် လုပ်သည့်အခါ တောတောင်အထပ်ထပ် ကိုပတ်၍ ဖောက် လုပ်ခြင်းထက်တောင်အချို့ကို ဥမင်လိုဏ် ခေါင်းဖောက် ၍ ဆောင်ရွက်ခြင်းက ပိုမိုထိရောက်သည့် အားလျော်စွာ လမ်းစီမံကိန်းအချို့၌ ဥမင် လိုဏ်ခေါင်း ဖောက်လုပ်မှုက တစ်စိတ်တစ်ပိုင်း ပါဝင်နေလေ့ရှိသည်။ ဖောက်လုပ်ထား သည့် ဥမင်၏အပေါ်နှင့် ဘေးပတ်လည်ရှိ မြေသားများသည် လိုဏ်ခေါင်းဖောက်ရာ၌ အသုံးပြုသည့် ဧရာမ လွန်သွားစက်ကြီးများ၏ တုန်ခါမှုဒဏ်ကြောင့် အတွင်း၌ လှိုက်၍ အက်ကွဲနေခဲ့လျှင် တစ်ချိန်ချိန်၌ ဥမင် လိုဏ်ခေါင်း မြေပြိုကျမှုဖြစ်ပွားလာနိုင်သည်။ \n","တံတားချဉ်းကပ်လမ်း မြေပြိုခြင်း\n\nမြစ်ချောင်းများကို ကျော်ဖြတ်နိုင်ရန် တံတားများ တည်ဆောက်ကြရာ၌ တံတားချဉ်းကပ် လမ်းများကိုလည်း တစ်ပါတည်း တည်ဆောက်ကြရသည်။ မိုးသည်းထန်စွာ ရွာသွန်းမှုကြောင့် ထုထည်ပမာဏ အလွန်များသော မြစ်ရေ၊ ချောင်းရေများ တစ်ဟုန်ထိုး စီးဆင်းသည့်အခါ တံတားရေလယ်တိုင်များ၏ ကြံ့ခိုင်မှုကို ထိပါးလျော့ကျ စေသည့်အတွက် တုန်ခါလှုပ်ယမ်းလာသော တံတားကြောင့် ချဉ်းကပ်လမ်းမြေသားများ ပြိုကျမှု ဖြစ်ပွားတတ်သည်။ \n","စီမံကိန်းလုပ်ငန်းခွင်အတွင်း မြေပြိုခြင်း\n\nအထပ်မြင့် အဆောက်အအုံများဆောက်လုပ်ခြင်း၊ စက်ရုံကြီးများဆောက်လုပ်ခြင်း၊ မွေးမြူရေးကန်များ ဖော်ထုတ်ခြင်း၊ ရေနံနှင့်ဓာတ်ငွေ့ပိုက်လိုင်းလမ်းကြောင်း တူးဖော်ခြင်း၊ ရွှေတူးဖော်ခြင်း၊ ကျောက်မျက်တူးဖော်ခြင်း၊ ကျောက်မီးသွေးတူးဖော်ခြင်း စသော စီမံကိန်းလုပ်ငန်းများတွင် တူးဆွဖော်ထုတ်ထားသော မြေစိုင်မြေခဲများကို သင့်လျော်ရာ နေရာတစ်ခုခုသို့ ပို့ဆောင်၍ စုပုံထားလေ့ရှိကြသည်။ နှစ်ကာလကြာမြင့်၍ မြေသားအစုအပုံကြီးဖြစ်လာ သည့်အချိန်၌ မြေပုံပေါ်၌နေအိမ် ဆောက်လုပ်နေထိုင် ခြင်း၊ မြေသယ်ယာဉ်များက မြေပုံပေါ်တက်ရောက်၍ တူးဆွမြေများကို ထပ်မံစုပုံခြင်း၊ မြေကော်စက်များဖြင့် မြေပုံပေါ်မှမြေသားများကိုသယ်ယူရွှေ့ပြောင်းခြင်း စသည်တို့ကို ပြုလုပ်သည့်အခါ ကျစ်လျစ်သိပ်သည်းမှု မရှိသော မြေသားများ ပြိုပျက်ကျဆင်းပြီးမြေပြိုမှု ဖြစ်ပွားတတ်သည်။ အလားတူပင် အထပ်မြင့်အဆောက်အအုံများ အတွက် အုတ်မြစ်ချသည့်အခါများ၌လည်း မြေအား စမ်းသပ်မှုကိုစနစ်တကျ မပြုလုပ်ဘဲ အဆောက်အအုံ အလျင်အမြန် ပြီးစီးရေးကိုသာ ရှေ့တန်းတင်ခဲ့သည့်အတွက်၊ အောက်ခံမြေသား ပြိုကျနိမ့်ဆင်းမှုဖြစ်ပေါ်ပြီး အဆောက်အအုံ ယိုင်နဲ့ခြင်း၊ အက်ကွဲခြင်း၊ ပြိုကျခြင်းများနှင့် ကြုံတွေ့ကြရလေ့ရှိသည်။ စီမံကိန်းတာဝန်ခံများ အရည်အချင်းမပြည့်ဝခြင်း၊ နည်းပညာအဆင့်နိမ့်ခြင်း၊ စီမံခန့်ခွဲမှု အားနည်းခြင်း၊ လုပ်ငန်းခွင်ကျွမ်းကျင်မှုမရှိခြင်း၊ ခေတ်မီစက်ပစ္စည်း ကိရိယာများကို အသုံးမပြုခြင်းစသော အကြောင်းတရား များသည် စီမံကိန်းလုပ်ငန်းခွင်များအတွင်း၌ မြေပြိုမှုကို ဖြစ်ပွားလာစေနိုင်သည်။ \n"};

        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,android.R.layout.simple_list_item_1,values);
        listView.setAdapter(adapter);

        mActionBarToolbar = (Toolbar) findViewById(R.id.toolbar);
        setSupportActionBar(mActionBarToolbar);
        getSupportActionBar().setTitle("မြေပြိုရခြင်း အကြောင်းအရင်းများ");

    }
}
